# Project 3: Predicting new Airbnb users' first destinations
# Part 2: SQL and EDA

## Using SQL to perform some EDA

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from patsy import dmatrix
import datetime
import numpy as np

%matplotlib inline

from sqlalchemy import create_engine
cnx = create_engine('postgresql://emilygeller:p@54.173.47.58:5432/emilygeller')

/Users/emilygeller/anaconda3/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [2]:
pd.read_sql('select * from countries;', cnx)

,country_destination,lat_destination,lng_destination,distance_km,destination_km2,destination_language,language_levenshtein_distance
0,AU,-26.853388,133.275160,15297.7440,7741220.0,eng,0.00
1,CA,62.393303,-96.818146,2828.1333,9984670.0,eng,0.00
2,DE,51.165707,10.452764,7879.5680,357022.0,deu,72.61
3,ES,39.896027,-2.487694,7730.7240,505370.0,spa,92.25
4,FR,46.232193,2.209667,7682.9450,643801.0,fra,92.06
5,GB,54.633220,-3.432277,6883.6590,243610.0,eng,0.00
6,IT,41.873990,12.564167,8636.6310,301340.0,ita,89.40
7,NL,52.133057,5.295250,7524.3203,41543.0,nld,63.22
8,PT,39.553444,-7.839319,7355.2534,92090.0,por,95.45
9,US,36.966427,-95.844030,0.0000,9826675.0,eng,0.00

In [4]:
pd.read_sql('select * from sessions limit 5;', cnx)

,id,user_id,action,action_type,action_detail,device_type,secs_elapsed
0,0,d1mm9tcy42,lookup,None,None,Windows Desktop,319.0
1,1,d1mm9tcy42,search_results,click,view_search_results,Windows Desktop,67753.0
2,2,d1mm9tcy42,lookup,None,None,Windows Desktop,301.0
3,3,d1mm9tcy42,search_results,click,view_search_results,Windows Desktop,22141.0
4,4,d1mm9tcy42,lookup,None,None,Windows Desktop,435.0

## Constructing features from Sessions data
I'll use SQL to build them.

###  Total seconds on site per user

In [9]:
q = '''
select user_id, sum(secs_elapsed)
from sessions
group by user_id
limit 5;
'''

In [10]:
pd.read_sql(q,cnx)

      user_id        sum
0  00023iyk9l   867896.0
1  0010k6l0om   586543.0
2  001wyh0pz8   282965.0
3  0028jgx1x1   297010.0
4  002qnbzfs5  6487080.0

### Total sessions per user

In [23]:
q = '''
select user_id, count(1)
from sessions
group by user_id
limit 5;'''

In [24]:
pd.read_sql(q,cnx)

      user_id  count
0  00023iyk9l     40
1  0010k6l0om     63
2  001wyh0pz8     90
3  0028jgx1x1     31
4  002qnbzfs5    789

### Total seconds on site per user per device

In [21]:
q = '''
select device_type, count(user_id)
from sessions
group by device_type
order by count desc;'''

In [22]:
pd.read_sql(q,cnx)

                         device_type    count
0                        Mac Desktop  3585886
1                    Windows Desktop  2648521
2                             iPhone  2096749
3                      Android Phone   835991
4                        iPad Tablet   681836
5   Android App Unknown Phone/Tablet   272820
6                          -unknown-   210059
7                             Tablet   139859
8                      Linux Desktop    27968
9                         Chromebook    22272
10                         iPodtouch     8186
11                     Windows Phone     2047
12                        Blackberry      979
13                       Opera Phone       68

Let's only look at the total time per user for the top four devices: `Mac Desktop`, `Windows Desktop`, `iPhone`, `Android Phone`.

In [43]:
q = '''
select sessions2.user_id, sessions2.total as Mac, sessions3.total as iPhone
from (
    select user_id, device_type, sum(secs_elapsed) total
    from sessions
    where device_type = 'Mac Desktop'
    group by user_id, device_type
    limit 5) sessions2
inner join (
    select user_id, device_type, sum(secs_elapsed) total
    from sessions 
    where device_type = 'iPhone'
    group by user_id, device_type
    limit 5) sessions3 on sessions2.user_id = sessions3.user_id;'''

In [44]:
pd.read_sql(q,cnx)

      user_id       mac    iphone
0  00023iyk9l  295642.0  572254.0

Verification:

In [31]:
q = '''
select user_id, device_type, sum(secs_elapsed)
from sessions
where user_id in ('0010k6l0om', '0035hobuyj', '00023iyk9l')
group by user_id, device_type;'''

In [32]:
pd.read_sql(q,cnx)

      user_id  device_type        sum
0  00023iyk9l       iPhone   572254.0
1  0010k6l0om  Mac Desktop   586543.0
2  00023iyk9l  Mac Desktop   295642.0
3  0035hobuyj  Mac Desktop  5724670.0